app/models/bdleitura.rb

    def check_status
            #VERIFICA SE CLIENTE E SENSOR ESTA ATIVO
            p "Cliente"
            cliente = Bdsensor.where("id = ?", bdsensor_id).select(:bdcliente_id).pluck(:bdcliente_id)
            p cliente[0]

            p "Cliente_ativo_inativo"
            cliente_ativo_inativo = Bdcliente.where("id=?", cliente[0]).select(:ativo_inativo).pluck(:ativo_inativo).first.to_i
            p cliente_ativo_inativo

            p "Sensor_ativo_inativo"
            results = Bdsensor.where("id=?", bdsensor_id).select(:ativo_inativo).pluck(:ativo_inativo)
            if results.all?(&:blank?) #= 'nil'
                  sensor_ativo_inativo = ""
                  p sensor_ativo_inativo
            else
                  sensor_ativo_inativo = Bdsensor.where("id=?", bdsensor_id).select(:ativo_inativo).pluck(:ativo_inativo).first.to_i
                  p sensor_ativo_inativo
            end

            p "Usuarios" #APENAS FOLLOW
            usuarios = Bdusuario.where("bdcliente_id = ?", cliente[0]).select(:celular).select(:SMS).pluck(:celular, :SMS)
            p usuarios

            if cliente_ativo_inativo == 1 && sensor_ativo_inativo == 1
                  sms_ativo = Bdusuario.where("Bdcliente_id = ?", cliente[0]).select(:SMS).select(:nome).select(:ativo_inativo).select(:celular)

                  sms_ativo.each do |s|
---
SELECT "bdsensors"."bdcliente_id" FROM "bdsensors" WHERE (id = 1)
SELECT "bdclientes"."ativo_inativo" FROM "bdclientes" WHERE (id=1)
SELECT "bdsensors"."ativo_inativo" FROM "bdsensors" WHERE (id=1)
SELECT "bdusuarios"."celular", "bdusuarios"."SMS" FROM "bdusuarios" WHERE (bdcliente_id = 1)
SELECT "bdusuarios"."SMS", "bdusuarios"."nome", "bdusuarios"."ativo_inativo", "bdusuarios"."celular" FROM "bdusuarios" WHERE (Bdcliente_id = 1)

                              #AQUISICAO DOS PARAMETROS PARA LOGICA

                              p "LI"
                              results = Bdsensor.where("id = ?", bdsensor_id).select(:LI).pluck(:LI)
---
SELECT "bdsensors"."LI" FROM "bdsensors" WHERE (id = 1)

                                    limite_inferior = ""
                                    p limite_inferior
                              else
                                    limite_inferior = Bdsensor.where("id = ?", bdsensor_id).select(:LI).pluck(:LI).first.to_f
---
SELECT "bdsensors"."LI" FROM "bdsensors" WHERE (id = 1)

                              end

                              p "LS"
                              results = Bdsensor.where("id = ?", bdsensor_id).select(:LS).pluck(:LS)
---
SELECT "bdsensors"."LS" FROM "bdsensors" WHERE (id = 1)

                                    limite_superior = ""
                                    p limite_superior
                              else
                                    limite_superior = Bdsensor.where("id = ?", bdsensor_id).select(:LS).pluck(:LS).first.to_f
---
SELECT "bdsensors"."LS" FROM "bdsensors" WHERE (id = 1)

                              end

                              p "Valor anterior"
                              results = Bdleitura.where("bdsensor_id = ?", bdsensor_id).select(:valor)
                              if results.all?(&:blank?) #= 'nil'
---
SELECT "bdleituras"."valor" FROM "bdleituras" WHERE (bdsensor_id = 1) ORDER BY "bdleituras"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "bdleituras"."valor" FROM "bdleituras" WHERE (bdsensor_id = 1)

                                    p "Valor"
                                    p valor
                              else
                                    valor_anterior = valor_anterior = Bdleitura.where("bdsensor_id = ?", bdsensor_id).select(:valor).last
---
SELECT "bdleituras"."valor" FROM "bdleituras" WHERE (bdsensor_id = 1) ORDER BY "bdleituras"."id" DESC LIMIT $1  [["LIMIT", 1]]



                              p "Flag notificacao"
                              results = Bdsensor.where("id = ?", bdsensor_id).select(:flag_notificacao).pluck(:flag_notificacao)
                              if results.all?(&:blank?) #= 'nil'
                                    p flag_notificacao = ""
                              else
                                    flag_notificacao = Bdsensor.where("id = ?", bdsensor_id).select(:flag_notificacao).pluck(:flag_notificacao).first.to_i
---
SELECT "bdsensors"."flag_notificacao" FROM "bdsensors" WHERE (id = 1)

                              end

                              p "Flag rearme"
                              results = Bdsensor.where("id = ?", bdsensor_id).select(:flag_rearme).pluck(:flag_rearme)
                              if results.all?(&:blank?) #= 'nil'
                                    p flag_rearme = ""
                              else
                                    flag_rearme = Bdsensor.where("id = ?", bdsensor_id).select(:flag_rearme).pluck(:flag_rearme).first.to_i
---
SELECT "bdsensors"."flag_rearme" FROM "bdsensors" WHERE (id = 1)

                              end

                              p "Flag mantec"
                              results = Bdsensor.where("id = ?", bdsensor_id).select(:flag_mantec).pluck(:flag_mantec)
                              if results.all?(&:blank?) #= 'nil'
                                    p flag_mantec = ""
                              else
                                    flag_mantec = Bdsensor.where("id = ?", bdsensor_id).select(:flag_mantec).pluck(:flag_mantec).first.to_i
---
SELECT "bdsensors"."flag_mantec" FROM "bdsensors" WHERE (id = 1)

                                                      p "Usuario ativo ou inativo"
                                                      p s[:ativo_inativo]
                                                      if s[:ativo_inativo] == 1
                                                            nome_da_empresa = Bdcliente.where("id = ?", cliente[0]).select(:nome_empresa).pluck(:nome_empresa)
---
SELECT "bdclientes"."nome_empresa" FROM "bdclientes" WHERE (id = 1)